{
  "level": "Graduate",
  "topics": [
    [
      "Social Science",
      "Public Administration",
      "Security Studies"
    ],
    [
      "Social Science",
      "Public Administration",
      "Military Studies"
    ],
    [
      "Social Science",
      "Political Science"
    ],
    [
      "Social Science",
      "Anthropology",
      "Social Anthropology"
    ]
  ],
  "instructors": {
    "content": [
      "64ad9580-20cd-8228-a824-72c59427777b"
    ],
    "website": "ocw-www"
  },
  "course_title": "Warlords, Terrorists, and Militias: Theorizing on Violent Non-State Actors",
  "course_description": "This course is a general overview of the recent political science literature on violent non-state actors. Its aim is to examine why non-state actors (such as warlords, terrorists, militias, etc.) resort to violence, what means and tactics they use, and what can be done to counter that violence. In that regard, the class will cover works pertaining to the production side of non-state violence (i.e. the objectives and organization of insurgents/terrorists/militias/warlords, their mobilization strategies and support base, how they coerce opponents, etc.); as well as the response that violence elicits from governments or other actors (i.e. counter-insurgency or counter-terrorism strategies, among others). Apart from introducing the basic variables and theoretical and empirical findings in the literature, this course will also grapple with questions of definition, operationalization of variables, and general methodology relevant to conducting research in this area of violent conflict. Though thematically-driven, this course will also reference cases from the contemporary battlefields of insurgency and terrorism (be it Afghanistan, Iraq, Pakistan, the West Bank and Gaza, Colombia, etc.) as they relate to the pertinent themes.\n",
  "department_numbers": [
    "17"
  ],
  "extra_course_numbers": "",
  "primary_course_number": "17.586",
  "learning_resource_types": [
    "Written Assignments with Examples"
  ],
  "title": "Course Metadata"
}